# https://code.cs50.io/
#백준
# 1065
# 2669
# 9012
# 10773
# 1157
# 7568
# 2789 (index 헷갈림)
# 4673
# 2511
# 10816 (시간 초과 조심, 900ms대인데 다른 사람들 코드 참고 필요)
# 7785 (많이 틀림)
# 11170
# 2798 블랙잭
# 2587 출력을 34.0 와 34 로 출력하기
# 1371 여전히 dict의 역순 정렬, value값으로 key값 접근 등 부족함, 리스트를 딕셔너리로 바꾸기
# 14467
# 2897
# 17388 map 함수에 대해 좀 더 공부하기
# 2495
# 2979 for 문 구간 설정 조심해야 함
# 1302 딕셔너리 lambda 다중조건일 경우
# 1764 입력 받기를 다르게 하면 백준 사이트에서 걸리는 시간 다름
# 11652 1764번과 거의 같이 풀었음
# 1420 대부분의 분들은 짧게 짰음. 난 길게 짰음
# 14720 길게 코드를 짰는데 효율적으로 짤 수도 있구나를 배웠음
# 1076 리스트와 인덱스를 잘 사용한 다른 사람 코드
# 10546 리스트의 remove add를 적절히 사용을 잘한 다른 사람 코드
# 11286 heap 어려움 (자료구조 heap)
# 4949 input()와 sys.stdin.readline().rstrip()의 차이
# 2776 join 매서드를 사용해서 효율적으로 문제 풀이한 다른 사람들 풀이 참고
# 25192 input()와 sys.stdin.readline().rstrip()의 차이
# 2669